Revit 2027 API
ParameterTypeId.SurfaceArea Property
 "Surface Area"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SurfaceArea { get; }
Public Shared ReadOnly Property SurfaceArea As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SurfaceArea {
	ForgeTypeId^ get ();
}
static member SurfaceArea : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace